Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/atdf/PIC32MM0064GPM036.atdf
      <value-group caption="CCPx Time Base Clock Select" name="CCP4CON1__CLKSEL">
         <value caption="System Clock (Fsys)" name="" value="0x0" />
         <value caption="REFCLKO Output Clock" name="" value="0x1" />
         <value caption="Secondary Oscillator Clock (SOSC)" name="" value="0x2" />
         <value caption="CLC1 Output" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="TCKIB Pin (remappable)" name="" value="0x6" />
         <value caption="TCKIA Pin (remappable)" name="" value="0x7" />
      </value-group>
      <value-group caption="CCPx Auto shutdown/Gating Source Enable" name="CCP4CON2__ASDG">
         <value caption="Disabled" name="" value="0x0" />
         <value caption="Comparator 1" name="" value="0x1" />
         <value caption="Comparator 2" name="" value="0x2" />
         <value caption="Comparator 3" name="" value="0x4" />
         <value caption="MCCP2 output" name="" value="0x8" />
         <value caption="MCCP1 output" name="" value="0x10" />
         <value caption="CLC1 output" name="" value="0x20" />
         <value caption="OCFA pin (remappable)" name="" value="0x40" />
         <value caption="OCFB pin (remappable)" name="" value="0x80" />
      </value-group>
      <value-group caption="CCPx Input Capture Source Select" name="CCP4CON2__ICS">
         <value caption="ICM4 pin (remappable)" name="" value="0x0" />
         <value caption="Comparator 1 Output" name="" value="0x1" />
         <value caption="Comparator 2 Output" name="" value="0x2" />
         <value caption="Comparator 3 Output" name="" value="0x3" />
         <value caption="CLC1 Output" name="" value="0x4" />
         <value caption="CLC2 Output" name="" value="0x5" />
         <value caption="CLC3 Output" name="" value="0x6" />
         <value caption="CLC4 Output" name="" value="0x7" />
      </value-group>
      <value-group caption="CCPx Time Base Clock Select" name="CCP5CON1__CLKSEL">
         <value caption="System Clock (Fsys)" name="" value="0x0" />
         <value caption="REFCLKO Output Clock" name="" value="0x1" />
         <value caption="Secondary Oscillator Clock (SOSC)" name="" value="0x2" />
         <value caption="CLC2 Output" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="TCKIB Pin (remappable)" name="" value="0x6" />
         <value caption="TCKIA Pin (remappable)" name="" value="0x7" />
      </value-group>
      <value-group caption="CCPx Auto shutdown/Gating Source Enable" name="CCP5CON2__ASDG">
         <value caption="Disabled" name="" value="0x0" />
         <value caption="Comparator 1" name="" value="0x1" />
         <value caption="Comparator 2" name="" value="0x2" />
         <value caption="Comparator 3" name="" value="0x4" />
         <value caption="MCCP2 output" name="" value="0x8" />
         <value caption="MCCP1 output" name="" value="0x10" />
         <value caption="CLC2 output" name="" value="0x20" />
         <value caption="OCFA pin (remappable)" name="" value="0x40" />
         <value caption="OCFB pin (remappable)" name="" value="0x80" />
      </value-group>
      <value-group caption="CCPx Input Capture Source Select" name="CCP5CON2__ICS">
         <value caption="ICM5 pin (remappable)" name="" value="0x0" />
         <value caption="Comparator 1 Output" name="" value="0x1" />
         <value caption="Comparator 2 Output" name="" value="0x2" />
         <value caption="Comparator 3 Output" name="" value="0x3" />
         <value caption="CLC1 Output" name="" value="0x4" />
         <value caption="CLC2 Output" name="" value="0x5" />
         <value caption="CLC3 Output" name="" value="0x6" />
         <value caption="CLC4 Output" name="" value="0x7" />
      </value-group>
      <value-group caption="CCPx Time Base Clock Select" name="CCP6CON1__CLKSEL">
         <value caption="System Clock (Fsys)" name="" value="0x0" />
         <value caption="REFCLKO Output Clock" name="" value="0x1" />
         <value caption="Secondary Oscillator Clock (SOSC)" name="" value="0x2" />
         <value caption="CLC3 Output" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="TCKIB Pin (remappable)" name="" value="0x6" />
         <value caption="TCKIA Pin (remappable)" name="" value="0x7" />
      </value-group>
      <value-group caption="CCPx Auto shutdown/Gating Source Enable" name="CCP6CON2__ASDG">
         <value caption="Disabled" name="" value="0x0" />
         <value caption="Comparator 1" name="" value="0x1" />
         <value caption="Comparator 2" name="" value="0x2" />
         <value caption="Comparator 3" name="" value="0x4" />
         <value caption="MCCP2 output" name="" value="0x8" />
         <value caption="MCCP1 output" name="" value="0x10" />
         <value caption="CLC3 output" name="" value="0x20" />
         <value caption="OCFA pin (remappable)" name="" value="0x40" />
         <value caption="OCFB pin (remappable)" name="" value="0x80" />
      </value-group>
      <value-group caption="CCPx Input Capture Source Select" name="CCP6CON2__ICS">
         <value caption="ICM6 pin (remappable)" name="" value="0x0" />
         <value caption="Comparator 1 Output" name="" value="0x1" />
         <value caption="Comparator 2 Output" name="" value="0x2" />
         <value caption="Comparator 3 Output" name="" value="0x3" />
         <value caption="CLC1 Output" name="" value="0x4" />
         <value caption="CLC2 Output" name="" value="0x5" />
         <value caption="CLC3 Output" name="" value="0x6" />
         <value caption="CLC4 Output" name="" value="0x7" />
      </value-group>
      <value-group caption="CCPx Time Base Clock Select" name="CCP7CON1__CLKSEL">
         <value caption="System Clock (Fsys)" name="" value="0x0" />
         <value caption="REFCLKO Output Clock" name="" value="0x1" />
         <value caption="Secondary Oscillator Clock (SOSC)" name="" value="0x2" />
         <value caption="CLC4 Output" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="TCKIB Pin (remappable)" name="" value="0x6" />
         <value caption="TCKIA Pin (remappable)" name="" value="0x7" />
      </value-group>
      <value-group caption="CCPx Auto shutdown/Gating Source Enable" name="CCP7CON2__ASDG">
         <value caption="Disabled" name="" value="0x0" />
         <value caption="Comparator 1" name="" value="0x1" />
         <value caption="Comparator 2" name="" value="0x2" />
         <value caption="Comparator 3" name="" value="0x4" />
         <value caption="MCCP2 output" name="" value="0x8" />
         <value caption="MCCP1 output" name="" value="0x10" />
         <value caption="CLC4 output" name="" value="0x20" />
         <value caption="OCFA pin (remappable)" name="" value="0x40" />
         <value caption="OCFB pin (remappable)" name="" value="0x80" />
      </value-group>
      <value-group caption="CCPx Input Capture Source Select" name="CCP7CON2__ICS">
         <value caption="ICM7 pin (remappable)" name="" value="0x0" />
         <value caption="Comparator 1 Output" name="" value="0x1" />
         <value caption="Comparator 2 Output" name="" value="0x2" />
         <value caption="Comparator 3 Output" name="" value="0x3" />
         <value caption="CLC1 Output" name="" value="0x4" />
         <value caption="CLC2 Output" name="" value="0x5" />
         <value caption="CLC3 Output" name="" value="0x6" />
         <value caption="CLC4 Output" name="" value="0x7" />
      </value-group>
