Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/atdf/PIC32MM0064GPM036.atdf
      <value-group caption="CLCx Output Polarity Control bit" name="CLC3CON__LCPOL">
         <value caption="The output of the module is inverted" name="" value="0x1" />
         <value caption="The output of the module is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Data Output Status bit" name="CLC3CON__LCOUT">
         <value caption="CLCx output high" name="" value="0x1" />
         <value caption="CLCx output low" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Port Enable bit" name="CLC3CON__LCOE">
         <value caption="CLCx port pin output is enabled" name="" value="0x1" />
         <value caption="CLCx port pin output is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Negative Edge Interrupt Enable bit" name="CLC3CON__INTN">
         <value caption="Interrupt will be generated when a falling edge occurs on LCOUT" name="" value="0x1" />
         <value caption="Interrupt will not be generated" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Positive Edge Interrupt Enable bit" name="CLC3CON__INTP">
         <value caption="Interrupt will be generated when a rising edge occurs on LCOUT" name="" value="0x1" />
         <value caption="Interrupt will not be generated" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Enable bit" name="CLC3CON__ON">
         <value caption="CLCx is enabled and mixing input signals" name="" value="0x1" />
         <value caption="CLCx is disabled and has logic zero outputs" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Polarity Control bit" name="CLC3CON__G1POL">
         <value caption="The output of Channel 1 logic is inverted when applied to the logic cell" name="" value="0x1" />
         <value caption="The output of Channel 1 logic is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 2 Polarity Control bit" name="CLC3CON__G2POL">
         <value caption="The output of Channel 2 logic is inverted when applied to the logic cell" name="" value="0x1" />
         <value caption="The output of Channel 2 logic is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 3 Polarity Control bit" name="CLC3CON__G3POL">
         <value caption="The output of Channel 3 logic is inverted when applied to the logic cell" name="" value="0x1" />
         <value caption="The output of Channel 3 logic is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 4 Polarity Control bit" name="CLC3CON__G4POL">
         <value caption="The output of Channel 4 logic is inverted when applied to the logic cell" name="" value="0x1" />
         <value caption="The output of Channel 4 logic is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Mode bits" name="CLC4CON__MODE">
         <value caption="Cell is a 1-input transparent latch with S and R" name="" value="0x7" />
         <value caption="Cell is a JK flip-flop with R" name="" value="0x6" />
         <value caption="Cell is a 2-input D flip-flop with R" name="" value="0x5" />
         <value caption="Cell is a 1-input D flip-flop with S and R" name="" value="0x4" />
         <value caption="Cell is an SR latch" name="" value="0x3" />
         <value caption="Cell is a 4-input AND" name="" value="0x2" />
         <value caption="Cell is an OR-XOR" name="" value="0x1" />
         <value caption="Cell is a AND-OR" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Output Polarity Control bit" name="CLC4CON__LCPOL">
         <value caption="The output of the module is inverted" name="" value="0x1" />
         <value caption="The output of the module is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Data Output Status bit" name="CLC4CON__LCOUT">
         <value caption="CLCx output high" name="" value="0x1" />
         <value caption="CLCx output low" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Port Enable bit" name="CLC4CON__LCOE">
         <value caption="CLCx port pin output is enabled" name="" value="0x1" />
         <value caption="CLCx port pin output is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Negative Edge Interrupt Enable bit" name="CLC4CON__INTN">
         <value caption="Interrupt will be generated when a falling edge occurs on LCOUT" name="" value="0x1" />
         <value caption="Interrupt will not be generated" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Positive Edge Interrupt Enable bit" name="CLC4CON__INTP">
         <value caption="Interrupt will be generated when a rising edge occurs on LCOUT" name="" value="0x1" />
         <value caption="Interrupt will not be generated" name="" value="0x0" />
      </value-group>
      <value-group caption="CLCx Enable bit" name="CLC4CON__ON">
         <value caption="CLCx is enabled and mixing input signals" name="" value="0x1" />
         <value caption="CLCx is disabled and has logic zero outputs" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Polarity Control bit" name="CLC4CON__G1POL">
         <value caption="The output of Channel 1 logic is inverted when applied to the logic cell" name="" value="0x1" />
         <value caption="The output of Channel 1 logic is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 2 Polarity Control bit" name="CLC4CON__G2POL">
         <value caption="The output of Channel 2 logic is inverted when applied to the logic cell" name="" value="0x1" />
         <value caption="The output of Channel 2 logic is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 3 Polarity Control bit" name="CLC4CON__G3POL">
         <value caption="The output of Channel 3 logic is inverted when applied to the logic cell" name="" value="0x1" />
         <value caption="The output of Channel 3 logic is not inverted" name="" value="0x0" />
      </value-group>
