Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/atdf/PIC32MM0064GPM036.atdf
      <value-group caption="Primary Oscillator (POSC) Ready Status bit" name="CLKSTAT__POSCRDY">
         <value caption="POSC is stable and ready" name="" value="0x1" />
         <value caption="POSC is disabled or not operating" name="" value="0x0" />
      </value-group>
      <value-group caption="Secondary Oscillator (SOSC) Ready Status bit" name="CLKSTAT__SOSCRDY">
         <value caption="SOSC is stable and ready" name="" value="0x1" />
         <value caption="SOSC is disabled or not operating" name="" value="0x0" />
      </value-group>
      <value-group caption="Low-Power RC (LPRC) Oscillator Ready Status bit" name="CLKSTAT__LPRCRDY">
         <value caption="LPRC is stable and ready" name="" value="0x1" />
         <value caption="LPRC is disabled or not operating" name="" value="0x0" />
      </value-group>
      <value-group caption="System PLL (SPLL) Ready Status bit" name="CLKSTAT__SPLLRDY">
         <value caption="SPLL is ready" name="" value="0x1" />
         <value caption="SPLL is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="FRC Oscillator Tuning bits" name="OSCTUN__TUN">
         <value caption="Center frequency -1.5%" name="" value="0x20" />
         <value caption="Center frequency; Oscillator runs at nominal frequency (8 MHz)" name="" value="0x0" />
         <value caption="Center frequency +1.453%" name="" value="0x1f" />
      </value-group>
      <value-group caption="Oscillator Switch Enable bit" name="OSCCON__OSWEN">
         <value caption="Initiate an oscillator switch to selection specified by NOSC bits" name="" value="0x1" />
         <value caption="Oscillator switch is complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Secondary Oscillator Enable bit" name="OSCCON__SOSCEN">
         <value caption="Enable Secondary Oscillator" name="ON" value="0x1" />
         <value caption="Disable Secondary Oscillator" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Clock Fail Detect bit" name="OSCCON__CF">
         <value caption="FSCM has detected a clock failure" name="" value="0x1" />
         <value caption="No clock failure has been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Sleep Mode Enable bit" name="OSCCON__SLPEN">
         <value caption="Device will enter Sleep mode when a WAIT instruction is executed" name="" value="0x1" />
         <value caption="Device will enter Idle mode when a WAIT instruction is executed" name="" value="0x0" />
      </value-group>
      <value-group caption="Clock Selection Lock Enable bit" name="OSCCON__CLKLOCK">
         <value caption="Clock and PLL selections are locked" name="" value="0x1" />
         <value caption="Clock and PLL selections are not locked and may be modified" name="" value="0x0" />
      </value-group>
      <value-group caption="New Oscillator Selection bits" name="OSCCON__NOSC">
         <value caption="Reserved" name="Reserved" value="0x7" />
         <value caption="Reserved" name="Reserved" value="0x6" />
         <value caption="Internal Low-Power RC (LPRC) Oscillator" name="LPRC" value="0x5" />
         <value caption="Secondary Oscillator (SOSC)" name="SOSC" value="0x4" />
         <value caption="Reserved" name="Reserved" value="0x3" />
         <value caption="Primary Oscillator (POSC) (HS or EC)" name="PRI" value="0x2" />
         <value caption="System PLL (SPLL)" name="PRIPLL" value="0x1" />
         <value caption="Internal Fast RC (FRC) Oscillator divided by FRCDIV bits (FRCDIV)" name="FRCDIV" value="0x0" />
      </value-group>
      <value-group caption="Current Oscillator Selection bits" name="OSCCON__COSC">
         <value caption="Reserved" name="Reserved" value="0x7" />
         <value caption="Reserved" name="Reserved" value="0x6" />
         <value caption="Internal Low-Power RC (LPRC) Oscillator" name="LPRC" value="0x5" />
         <value caption="Secondary Oscillator (SOSC)" name="SOSC" value="0x4" />
         <value caption="Reserved" name="Reserved" value="0x3" />
         <value caption="Primary Oscillator (POSC) (HS or EC)" name="PRI" value="0x2" />
         <value caption="System PLL (SPLL)" name="PRIPLL" value="0x1" />
         <value caption="Internal Fast RC (FRC) Oscillator divided by FRCDIV bits (FRCDIV)" name="FRCDIV" value="0x0" />
      </value-group>
      <value-group caption="Internal Fast RC Oscillator Clock Divider bits" name="OSCCON__FRCDIV">
         <value caption="FRC divided by 256" name="DIV_256" value="0x7" />
         <value caption="FRC divided by 64" name="DIV_64" value="0x6" />
         <value caption="FRC divided by 32" name="DIV_32" value="0x5" />
         <value caption="FRC divided by 16" name="DIV_16" value="0x4" />
         <value caption="FRC divided by 8" name="DIV_8" value="0x3" />
         <value caption="FRC divided by 4" name="DIV_4" value="0x2" />
         <value caption="FRC divided by 2" name="DIV_2" value="0x1" />
         <value caption="FRC divided by 1 (default setting)" name="DIV_1" value="0x0" />
      </value-group>
      <value-group caption="System PLL Input Clock Source bit" name="SPLLCON__PLLICLK">
         <value caption="FRC is selected as the input to the System PLL" name="" value="0x1" />
         <value caption="POSC is selected as the input to the System PLL" name="" value="0x0" />
      </value-group>
      <value-group caption="System PLL Multiplier bits" name="SPLLCON__PLLMULT">
         <value caption="Multiply by 24" name="MUL_24" value="0x6" />
         <value caption="Multiply by 12" name="MUL_12" value="0x5" />
         <value caption="Multiply by 8" name="MUL_8" value="0x4" />
         <value caption="Multiply by 6" name="MUL_6" value="0x3" />
         <value caption="Multiply by 4" name="MUL_4" value="0x2" />
         <value caption="Multiply by 3" name="MUL_3" value="0x1" />
         <value caption="Multiply by 2" name="MUL_2" value="0x0" />
      </value-group>
      <value-group caption="System PLL Output Clock Divider bits" name="SPLLCON__PLLODIV">
         <value caption="PLL Divide by 256" name="DIV_256" value="0x7" />
         <value caption="PLL Divide by 64" name="DIV_64" value="0x6" />
         <value caption="PLL Divide by 32" name="DIV_32" value="0x5" />
         <value caption="PLL Divide by 16" name="DIV_16" value="0x4" />
         <value caption="PLL Divide by 8" name="DIV_8" value="0x3" />
         <value caption="PLL Divide by 4" name="DIV_4" value="0x2" />
         <value caption="PLL Divide by 2" name="DIV_2" value="0x1" />
         <value caption="PLL Divide by 1" name="DIV_1" value="0x0" />
      </value-group>
   </module>
